exade_documents_request_1.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <SOAP-ENV:Body>
    <webservice_tarificateurRequest xmlns="http://www.4D.com/webservices/">
      
<licence>GMB#7ùuQefujig8fu1+rulyXa)it</licence>
<code_courtier>815178</code_courtier>
<type_operation>2</type_operation>
<type_operation_document>1</type_operation_document>
<id_tarif>10</id_tarif>

<simulation>
  <date_effet>20251222</date_effet>
  <frac_assurance>12</frac_assurance>
  <type_credit>0</type_credit>
  <id_objetdufinancement>1</id_objetdufinancement>

  <assure>
    <id_assure>1</id_assure>
    <type_assure>0</type_assure>
    <civilite>1</civilite>
    <nom>DOCUMENT</nom>
    <prenom>Test</prenom>
    <nom_naissance>DOCUMENT</nom_naissance>
    <date_naissance>19850315</date_naissance>
    <lieu_naissance>Paris</lieu_naissance>
    <sexe>1</sexe>
    <fumeur>0</fumeur>
    <categorie_professionnelle>1</categorie_professionnelle>
    <deplacement_pro>1</deplacement_pro>
    <travaux_manuels>0</travaux_manuels>
  </assure>

  <pret>
    <id_pret>1</id_pret>
    <numero>1</numero>
    <type_pret>1</type_pret>
    <capital>20000000</capital>
    <taux>350</taux>
    <type_taux>1</type_taux>
    <duree>240</duree>
    <differe>0</differe>
    <amortissement>12</amortissement>
    <date_deblocage>20251222</date_deblocage>
  </pret>

  <garantie_pret>
    <id_assure>1</id_assure>
    <id_pret>1</id_pret>
    <garantie>2</garantie>
    <quotite>100</quotite>
  </garantie_pret>
</simulation>

    </webservice_tarificateurRequest>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>